home/.doom.d/config.org
#+title: Doom Emacs Literate Config
#+author: Dylan Morgan
#+email: dbmorgan98@gmail.com
#+export_file_name: ./README.org
#+property: header-args :tangle config.el :results none
#+startup: content

* Table of Contents :toc:
- [[#introduction][Introduction]]
  - [[#installation-instructions][Installation Instructions]]
  - [[#use-package-guide][Use-package guide]]
- [[#setup][Setup]]
  - [[#lexical-binding][Lexical Binding]]
  - [[#browser][Browser]]
  - [[#buffers][Buffers]]
  - [[#chatgpt-shell][ChatGPT-Shell]]
  - [[#delays][Delays]]
  - [[#dirvish][Dirvish]]
  - [[#eval][Eval]]
  - [[#evil][Evil]]
  - [[#file-types][File types]]
  - [[#general][General]]
  - [[#languagetool][Languagetool]]
  - [[#lines][Lines]]
  - [[#personal-information][Personal Information]]
  - [[#projectile][Projectile]]
  - [[#spelling][Spelling]]
  - [[#emacsclient][EmacsClient]]
  - [[#treemacs][Treemacs]]
  - [[#tramp][Tramp]]
  - [[#web][Web]]
  - [[#windows][Windows]]
  - [[#yasnippets][Yasnippets]]
- [[#appearance][Appearance]]
  - [[#fonts][Fonts]]
  - [[#minimap][Minimap]]
  - [[#modeline][Modeline]]
  - [[#splash-screen][Splash Screen]]
  - [[#tabs][Tabs]]
  - [[#theme][Theme]]
- [[#languages][Languages]]
  - [[#general-1][General]]
  - [[#magit][Magit]]
  - [[#bash][Bash]]
  - [[#fortran][Fortran]]
  - [[#julia][Julia]]
  - [[#latex][LaTeX]]
  - [[#lsp][LSP]]
  - [[#markdown][Markdown]]
  - [[#python][Python]]
  - [[#rust][Rust]]
- [[#org-mode][Org-mode]]
  - [[#agenda][Agenda]]
  - [[#appear][Appear]]
  - [[#attach][Attach]]
  - [[#babel][Babel]]
  - [[#buffers-1][Buffers]]
  - [[#capture][Capture]]
  - [[#cite][Cite]]
  - [[#company][Company]]
  - [[#exporting][Exporting]]
  - [[#file-conversions][File Conversions]]
  - [[#file-headers][File Headers]]
  - [[#general-2][General]]
  - [[#headings][Headings]]
  - [[#images][Images]]
  - [[#jupyter][Jupyter]]
  - [[#journal][Journal]]
  - [[#keybindings][Keybindings]]
  - [[#latex-1][LaTeX]]
  - [[#presentations][Presentations]]
  - [[#prettification][Prettification]]
  - [[#roam][Roam]]
  - [[#snippet-helpers][Snippet Helpers]]
  - [[#src-blocks][SRC Blocks]]
  - [[#table-of-contents][Table of Contents]]
  - [[#todos][TODOs]]
- [[#shells][Shells]]
  - [[#vterm][vterm]]
  - [[#eshell][eshell]]
  - [[#prompt][Prompt]]
- [[#help][Help]]

* Introduction
GNU Emacs is an extendable and highly customisable text editor. It is based on an Emacs Lisp interpreter with extensions for text editing. Emacs has been extended in essentially all areas of computing, giving rise to a vast array of packages supporting, e.g., email, IRC and XMPP messaging, spreadsheets, remote server editing, and much more. Emacs includes extensive documentation on all aspects of the system, from basic editing to writing large Lisp programs. It has full Unicode support for nearly all human languages.

** Installation Instructions
2. ~cd ~/.doom.d/~
3. Install the necessary programs when you inevitably get lots of errors!
4. Waste lots of time learning how to use emacs, tweaking the configuration yourself, get frustrated, and ultimately return to using vim or VScode

** TODO Use-package guide

* Setup
** Lexical Binding

I think this has to go at the top of the file (almost like a shebang)

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

** Browser
Use firefox by default

#+begin_src emacs-lisp
;; (setq browse-url-browser-function 'browse-url-firefox
;;       browse-url-generic-program "firefox")

(setq browse-url-browser-function 'xwidget-webkit-browse-url)
#+end_src

Enable usage of the atomic extension

#+begin_src emacs-lisp
(add-transient-hook! 'focus-out-hook (atomic-chrome-start-server))
#+end_src

** Buffers
+ I’d much rather have my new buffers in org-mode than fundamental-mode
+ Nicer default buffer names
+ Only include the buffer name in the title, and then if applicable, the project folder
  - Also mark if the file has unsaved changes

#+begin_src emacs-lisp
;; (setq-default major-mode 'org-mode)

(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(setq frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?  buffer-file-name))
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))

(map! :leader
      :prefix "b"
      :desc "Flycheck errors" "e" #'consult-flycheck
      :desc "Focus lines" "F" #'consult-focus-lines
      :desc "History" "h" #'consult-history)
#+end_src

** ChatGPT-Shell
Lazy load API key and add keybindings for usage

#+begin_src emacs-lisp
(use-package! chatgpt-shell
  :config
  (setq chatgpt-shell-openai-key
        (lambda ()
          (auth-source-pick-first-password :host "api.openai.com")))
  (setq chatgpt-shell-anthropic-key
        (lambda ()
          (auth-source-pick-first-password :host "api.anthropic.com")))
  (setq chatgpt-shell-model-version "gpt-4o")
  (setq chatgpt-shell-insert-dividers t))

(map! :leader
      (:prefix-map ("a" . "ai")
       :desc "chatgpt shell" "a" #'chatgpt-shell
       :desc "C-c C-c" "C" #'chatgpt-shell-ctrl-c-ctrl-c
       (:prefix ("d" . "describe")
        :desc "code" "c" #'chatgpt-shell-describe-code
        :desc "image" "i" #'chatgpt-shell-describe-image)
       :desc "edit block" "e" #'chatgpt-shell-edit-block-at-point
       :desc "execute babel" "B" #'chatgpt-shell-execute-babel-block-action-at-point
       :desc "execute block" "b" #'chatgpt-shell-execute-block-action-at-point
       :desc "fix error" "E" #'chatgpt-shell-fix-error-at-point
       :desc "create unit test" "u" #'chatgpt-shell-generate-unit-test
       :desc "interrupt" "I" #'chatgpt-shell-interrupt
       :desc "awesome prompts" "A" #'chatgpt-shell-load-awesome-prompts
       :desc "mark dwim" "M" #'chatgpt-shell-mark-at-point-dwim
       :desc "version" "V" #'chatgpt-shell-model-version
       :desc "next" "n" #'chatgpt-shell-next-item
       :desc "previous" "N" #'chatgpt-shell-previous-item
       :desc "prompt minibuffer" "f" #'chatgpt-shell-prompt
       (:prefix ("p" . "prompt compose")
        :desc "prompt" "p" #'chatgpt-shell-prompt-compose
        :desc "from kill-ring" "k" #'chatgpt-shell-prompt-appending-kill-ring
        :desc "cancel" "Q" #'chatgpt-shell-prompt-compose-cancel
        :desc "insert block" "i" #'chatgpt-shell-prompt-compose-insert-block-at-point
        :desc "next history" "h" #'chatgpt-shell-prompt-compose-next-history
        :desc "next item" "n" #'chatgpt-shell-prompt-compose-next-item
        :desc "buffer" "b" #'chatgpt-shell-prompt-compose-other-buffer
        :desc "previous history" "H" #'chatgpt-shell-prompt-compose-previous-history
        :desc "previous item" "N" #'chatgpt-shell-prompt-compose-previous-item
        :desc "quit" "q" #'chatgpt-shell-prompt-compose-quit-and-close-frame
        :desc "refresh" "R" #'chatgpt-shell-prompt-compose-refresh
        :desc "reply" "r" #'chatgpt-shell-prompt-compose-reply
        :desc "search history" "s" #'chatgpt-shell-prompt-compose-search-history
        :desc "send" "S" #'chatgpt-shell-prompt-compose-send-buffer
        :desc "swap prompt" "P" #'chatgpt-shell-prompt-compose-swap-system-prompt
        :desc "swap model" "m" #'chatgpt-shell-prompt-compose-swap-model-version)
       :desc "insert" "i" #'chatgpt-shell-quick-insert
       :desc "refactor code" "r" #'chatgpt-shell-refactor-code
       :desc "transcript restore" "T" #'chatgpt-shell-restore-session-from-transcript
       :desc "transcript save" "t" #'chatgpt-shell-save-session-transcript
       :desc "history search" "h" #'chatgpt-shell-search-history
       :desc "send and review" "S" #'chatgpt-shell-send-and-review-region
       :desc "send" "s" #'chatgpt-shell-send-region
       :desc "swap model" "m" #'chatgpt-shell-swap-model
       :desc "swap prompt" "P" #'chatgpt-shell-swap-system-prompt
       :desc "view" "v" #'chatgpt-shell-view-at-point
       :desc "view code" "V" #'chatgpt-shell-view-block-at-point
       :desc "git commit" "g" #'chatgpt-shell-write-git-commit))
#+end_src

** Delays
I like to have custom delays for company mode, the leader key, and the spell checker:

#+begin_src emacs-lisp
(setq which-key-idle-delay 0.2)

(setq company-idle-delay 0.3
      company-maximum-prefix-length 3)

(after! spell-fu
  (setq spell-fu-idle-delay 0.5))
#+end_src
** Dirvish
Let Dirvish take over Dired globally

#+begin_src emacs-lisp
(use-package! dirvish
  :defer t
  :init
  (dirvish-override-dired-mode)
  :config
  (setq dirvish-side-follow-mode t
        dirvish-peek-mode t
        dirvish-preview-dispatchers
        (cl-substitute 'pdf-preface 'pdf dirvish-preview-dispatchers)))
#+end_src

** Eval
Enable inline evaluation of code, but use a nicer prefix

#+begin_src emacs-lisp
(setq eros-eval-result-prefix "⟹ ") ; default =>
#+end_src

** Evil
When I want to make a substitution, I want it to be global more often than not — so let’s make that the default.

#+begin_src emacs-lisp
(after! evil
  (setq evil-kill-on-visual-paste nil)) ; Don't put overwritten text in the kill ring

(map! :map evil-insert-state-map
      "C-p" #'evil-previous-line
      "C-n" #'evil-next-line)
#+end_src

Change some of the default evil maps so I can still use emacs-like keybindings in insert mode

** File types
