home/.doom.d/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; (setq browse-url-browser-function 'browse-url-firefox
;;       browse-url-generic-program "firefox")

(setq browse-url-browser-function 'xwidget-webkit-browse-url)

(add-transient-hook! 'focus-out-hook (atomic-chrome-start-server))

;; (setq-default major-mode 'org-mode)

(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(setq frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?  buffer-file-name))
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))

(map! :leader
      :prefix "b"
      :desc "Flycheck errors" "e" #'consult-flycheck
      :desc "Focus lines" "F" #'consult-focus-lines
      :desc "History" "h" #'consult-history)

(use-package! chatgpt-shell
  :config
  (setq chatgpt-shell-openai-key
        (lambda ()
          (auth-source-pick-first-password :host "api.openai.com")))
  (setq chatgpt-shell-anthropic-key
        (lambda ()
          (auth-source-pick-first-password :host "api.anthropic.com")))
  (setq chatgpt-shell-model-version "gpt-4o")
  (setq chatgpt-shell-insert-dividers t))

(map! :leader
      (:prefix-map ("a" . "ai")
       :desc "chatgpt shell" "a" #'chatgpt-shell
       :desc "C-c C-c" "C" #'chatgpt-shell-ctrl-c-ctrl-c
       (:prefix ("d" . "describe")
        :desc "code" "c" #'chatgpt-shell-describe-code
        :desc "image" "i" #'chatgpt-shell-describe-image)
       :desc "edit block" "e" #'chatgpt-shell-edit-block-at-point
       :desc "execute babel" "B" #'chatgpt-shell-execute-babel-block-action-at-point
       :desc "execute block" "b" #'chatgpt-shell-execute-block-action-at-point
       :desc "fix error" "E" #'chatgpt-shell-fix-error-at-point
       :desc "create unit test" "u" #'chatgpt-shell-generate-unit-test
       :desc "interrupt" "I" #'chatgpt-shell-interrupt
       :desc "awesome prompts" "A" #'chatgpt-shell-load-awesome-prompts
       :desc "mark dwim" "M" #'chatgpt-shell-mark-at-point-dwim
       :desc "version" "V" #'chatgpt-shell-model-version
       :desc "next" "n" #'chatgpt-shell-next-item
       :desc "previous" "N" #'chatgpt-shell-previous-item
       :desc "prompt minibuffer" "f" #'chatgpt-shell-prompt
       (:prefix ("p" . "prompt compose")
        :desc "prompt" "p" #'chatgpt-shell-prompt-compose
        :desc "from kill-ring" "k" #'chatgpt-shell-prompt-appending-kill-ring
        :desc "cancel" "Q" #'chatgpt-shell-prompt-compose-cancel
        :desc "insert block" "i" #'chatgpt-shell-prompt-compose-insert-block-at-point
        :desc "next history" "h" #'chatgpt-shell-prompt-compose-next-history
        :desc "next item" "n" #'chatgpt-shell-prompt-compose-next-item
        :desc "buffer" "b" #'chatgpt-shell-prompt-compose-other-buffer
        :desc "previous history" "H" #'chatgpt-shell-prompt-compose-previous-history
        :desc "previous item" "N" #'chatgpt-shell-prompt-compose-previous-item
        :desc "quit" "q" #'chatgpt-shell-prompt-compose-quit-and-close-frame
        :desc "refresh" "R" #'chatgpt-shell-prompt-compose-refresh
        :desc "reply" "r" #'chatgpt-shell-prompt-compose-reply
        :desc "search history" "s" #'chatgpt-shell-prompt-compose-search-history
        :desc "send" "S" #'chatgpt-shell-prompt-compose-send-buffer
        :desc "swap prompt" "P" #'chatgpt-shell-prompt-compose-swap-system-prompt
        :desc "swap model" "m" #'chatgpt-shell-prompt-compose-swap-model-version)
       :desc "insert" "i" #'chatgpt-shell-quick-insert
       :desc "refactor code" "r" #'chatgpt-shell-refactor-code
       :desc "transcript restore" "T" #'chatgpt-shell-restore-session-from-transcript
       :desc "transcript save" "t" #'chatgpt-shell-save-session-transcript
       :desc "history search" "h" #'chatgpt-shell-search-history
       :desc "send and review" "S" #'chatgpt-shell-send-and-review-region
       :desc "send" "s" #'chatgpt-shell-send-region
       :desc "swap model" "m" #'chatgpt-shell-swap-model
       :desc "swap prompt" "P" #'chatgpt-shell-swap-system-prompt
       :desc "view" "v" #'chatgpt-shell-view-at-point
       :desc "view code" "V" #'chatgpt-shell-view-block-at-point
       :desc "git commit" "g" #'chatgpt-shell-write-git-commit))

(setq which-key-idle-delay 0.2)

(setq company-idle-delay 0.3
      company-maximum-prefix-length 3)

(after! spell-fu
  (setq spell-fu-idle-delay 0.5))

(use-package! dirvish
  :defer t
  :init
  (dirvish-override-dired-mode)
  :config
  (setq dirvish-side-follow-mode t
        dirvish-peek-mode t
        dirvish-preview-dispatchers
        (cl-substitute 'pdf-preface 'pdf dirvish-preview-dispatchers)))

(setq eros-eval-result-prefix "⟹ ") ; default =>

(after! evil
  (setq evil-kill-on-visual-paste nil)) ; Don't put overwritten text in the kill ring

(map! :map evil-insert-state-map
      "C-p" #'evil-previous-line
      "C-n" #'evil-next-line)

(use-package! nov
