home/.doom.d/config.org
*** Ebooks
Integrate books into emacs

#+begin_src emacs-lisp
(use-package! nov
  :mode ("\\.epub\\'" . nov-mode)
  :config
  ;; (map! :map nov-mode-map
  ;;       :n "RET" #'nov-scroll-up)

  (advice-add 'nov-render-title :override #'ignore)

  (defun +nov-mode-setup ()
    "Tweak nov-mode to our liking."
    ;; (face-remap-add-relative 'variable-pitch
    ;;                          :family "Merriweather"
    ;;                          :height 1.4
    ;;                          :width 'semi-expanded)
    (face-remap-add-relative 'default :height 1.3)
    (variable-pitch-mode 1)
    (setq-local line-spacing 0.2
                next-screen-context-lines 4
                shr-use-colors nil)
    (when (require 'visual-fill-column nil t)
      (setq-local visual-fill-column-center-text t
                  visual-fill-column-width 64
                  nov-text-width 106)
      (visual-fill-column-mode 1))
    (when (featurep 'hl-line-mode)
      (hl-line-mode -1))
    ;; Re-render with new display settings
    (nov-render-document)
    ;; Look up words with the dictionary.
    (add-to-list '+lookup-definition-functions #'+lookup/dictionary-definition))

  (add-hook 'nov-mode-hook #'+nov-mode-setup))
#+end_src

Extend =nov-mode= with build in with the built in xwidget webkit and render the epub html/xhtml files with any customized CSS styles or JavaScript scripts.

#+begin_src emacs-lisp
(use-package nov-xwidget
  :after nov
  :config
  (add-hook! 'nov-mode-hook #'nov-xwidget-inject-all-files))
#+end_src

To enhance the reading experience, we can create a nice minimal modeline, with just the basic bare minimum, information about the book/chapter, and possibly currently playing media.

#+begin_src emacs-lisp
(after! doom-modeline
  (defvar doom-modeline-nov-title-max-length 40)
  (doom-modeline-def-segment nov-author
    (propertize
     (cdr (assoc 'creator nov-metadata))
     'face (doom-modeline-face 'doom-modeline-project-parent-dir)))
  (doom-modeline-def-segment nov-title
    (let ((title (or (cdr (assoc 'title nov-metadata)) "")))
      (if (<= (length title) doom-modeline-nov-title-max-length)
          (concat " " title)
        (propertize
         (concat " " (truncate-string-to-width title doom-modeline-nov-title-max-length nil nil t))
         'help-echo title))))
  (doom-modeline-def-segment nov-current-page
    (let ((words (count-words (point-min) (point-max))))
      (propertize
       (format " %d/%d"
               (1+ nov-documents-index)
               (length nov-documents))
       'face (doom-modeline-face 'doom-modeline-info)
       'help-echo (if (= words 1) "1 word in this chapter"
                    (format "%s words in this chapter" words)))))
  (doom-modeline-def-segment scroll-percentage-subtle
    (concat
     (doom-modeline-spc)
     (propertize (format-mode-line '("" doom-modeline-percent-position "%%"))
                 'face (doom-modeline-face 'shadow)
                 'help-echo "Buffer percentage")))

  (doom-modeline-def-modeline 'nov
    '(workspace-name window-number nov-author nov-title nov-current-page scroll-percentage-subtle))
    ;; '(media-player misc-info major-mode time))

  (add-to-list 'doom-modeline-mode-alist '(nov-mode . nov)))
#+end_src

** General
+ Let Emacs know I am using fish as my default shell
+ Delete files to trash
+ Stretch cursor to the glyph width
+ Raise undo limit to 80MB
+ Whether actions are undone in several steps
+ Nobody likes to lose work
+ How many seconds passwords are cached
+ Controls if scroll commands move point to keep its screen position unchanged
+ Number of lines of margin at the top and bottom of a window
+ Show traceback on error
+ Iterate through CamelCase words
+ Replace I-search binding with swiper
+ Include a 'leader-undo' button
+ Disable massive toolbar on MacOS
+ Enable nice scrolling

#+begin_src emacs-lisp
;; Change the default shell to fish
(setq shell-file-name (executable-find "bash"))
(setq vterm-shell (executable-find "fish"))
(setq explicit-shell-file-name (executable-find "fish"))

;; Use the system trash
(setq delete-by-moving-to-trash t
      x-stretch-cursor t)

;; General file settings
(setq undo-limit 80000000
      evil-want-fine-undo t
      auto-save-default t
      password-cache-expiry 300
      scroll-preserve-screen-position 'always
      scroll-margin 4)
;; debug-on-error t)

(global-subword-mode t)

;; Set vertico/consult commands
(map! "C-s" #'+default/search-buffer)
(map! "C-M-s" #'+vertico/search-symbol-at-point)
(map! :leader
      :prefix "s"
      :desc "fd file" "f" #'+vertico/consult-fd-or-find
      :desc "ripgrep file" "g" #'consult-ripgrep
      :desc "Search help" "h" #'consult-info
      :desc "Search man" "M" #'consult-man
      :desc "Outline" "o" #'consult-outline)

;; TODO
;; Use delete to move back a page in which-key
;; (map! which-key-mode-map
;;       "DEL" #'which-key-undo)

;; Disable toolbar on mac
(when (string= (system-name) "maccie")
  (add-hook 'doom-after-init-hook (lambda () (tool-bar-mode 1) (tool-bar-mode 0))))

;; Enable nicer scrolling
(pixel-scroll-precision-mode)
#+end_src

** TODO Languagetool

#+begin_src emacs-lisp
;; (use-package! languagetool
;;   :defer t
;;   :commands (languagetool-check
;;              languagetool-clear-suggestions
;;              languagetool-correct-at-point
;;              languagetool-correct-buffer
;;              languagetool-set-language
;;              languagetool-server-mode
;;              languagetool-server-start
;;              languagetool-server-stop)
;;   :config
;;   (setq languagetool-java-arguments '("-Dfile.encoding=UTF-8" "-cp" "/opt/homebrew/Cellar/languagetool/*/libexec/*")
;;         languagetool-console-command "org.languagetool.server.commandline.Main"
;;         languagetool-server-command "org.languagetool.server.HTTPServer"))
#+end_src

** Lines
This determines the style of line numbers in effect. If set to `nil', line numbers are disabled. For relative line numbers, set this to `relative'.

Automatically wrap text when it reaches the end of the screen

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)

(add-hook 'text-mode-hook 'turn-on-visual-line-mode)
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))

;; (setq-default auto-fill-function 'do-auto-fill)
#+end_src

** Personal Information
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates, and snippets.

Set the GPG directories and increase the cache expiry

#+begin_src emacs-lisp
(setq user-full-name "Dylan Morgan"
      user-mail-address "dbmorgan98@protonmail.com")

(after! auth-source
  (setq auth-source-cache-expiry 21600))  ; Change default to 6 hours to get me through most of a work day
#+end_src

** Projectile
Change the default sort order so it lists the most recent files and directories
opened first and enable project caching

#+begin_src emacs-lisp
(setq projectile-sort-order 'recentf
      projectile-auto-discover t)

(setq projectile-enable-caching t)
(setq projectile-file-exists-remote-cache-expire (* 10 60))
#+end_src

** Spelling

My spelling is really bad so it needs checkling

#+begin_src emacs-lisp
(after! spell-fu
  (setq ispell-personal-dictionary "~/.config/emacs/.local/etc/ispell/.pws")
  (setq ispell-dictionary "en_GB"))

(use-package! jinx
  :defer t
  :init
  (setenv "PKG_CONFIG_PATH" (concat "/opt/homebrew/opt/glib/lib/pkgconfig/:" (getenv "PKG_CONFIG_PATH")))
  (add-hook 'doom-init-ui-hook #'global-jinx-mode)
  :config
  (setq jinx-languages "en_GB")
  ;; Extra face(s) to ignore
  (push 'org-inline-src-block
        (alist-get 'org-mode jinx-exclude-faces)))

(map! :after jinx
      :map jinx-overlay-map
      "M-o" #'jinx-correct
      "M-S-o" #'jinx-correct-all)

;;   ;; Take over the relevant bindings.
;;   (after! ispell
;;     (global-set-key [remap ispell-word] #'jinx-correct))
;;   (after! evil-commands
;;     (global-set-key [remap evil-next-flyspell-error] #'jinx-next)
;;     (global-set-key [remap evil-prev-flyspell-error] #'jinx-previous))
#+end_src

** EmacsClient
