home/.doom.d/config.org
*** Systemd
Use emacs as a client.

Setup the systemd file here

#+name emacsclient service
#+begin_src systemd :tangle ~/.config/systemd/user/emacs.service :mkdirp yes
[Unit]
Description=Emacs server daemon
Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/
# Wants=gpg-agent.service

[Service]
Type=simple
ExecStart=/usr/local/bin/emacs --fg-daemon
ExecStop=emacsclient --no-wait --eval "(progn (setq kill-emacs-hook nil) (kill emacs))"
# ExecStop=/usr/local/bin/emacsclient --eval "(kill-emacs)"
# Environment=COLORTERM=truecolor
Environment=SSH_AUTH_SOCK=%t/keyring/ssh
Restart=on-failure

[Install]
WantedBy=default.target
#+end_src

which is then enabled by

#+begin_src fish :tangle (if (string= "enabled\n" (shell-command-to-string "systemctl --user is-enabled emacs.service")) "no" "setup.sh") :results silent
systemctl --user enable emacs.service
#+end_src

Add a doctor ~warning~ if this is not enabled

#+begin_src emacs-lisp
;; (unless (string= "enabled\n" (shell-command-to-string "systemctl --user is-enabled emacs.service"))
;;   (warn! "Emacsclient service is not enabled."))
#+end_src

It can now be nice to use this as a 'default app' for opening files. If we add an appropriate desktop entry, and enable it in the desktop environment.

#+begin_src conf :tangle ~/.local/share/applications/emacs-client.desktop :mkdirp yes
[Desktop Entry]
Name=Emacs client
GenericName=Text Editor
Comment=A flexible platform for end-user applications
MimeType=text/english;text/plain;text/x-makefile;text/x-c++hdr;text/x-c++src;text/x-chdr;text/x-csrc;text/x-java;text/x-moc;text/x-pascal;text/x-tcl;text/x-tex;application/x-shellscript;text/x-c;text/x-c++;
Exec=/home/dylanmorgan/Applications/emacs-29.3/build/lib-src/emacsclient -create-frame --alternate-editor="" --no-wait %F
Icon=emacs
Type=Application
Terminal=false
Categories=TextEditor;Utility;
StartupWMClass=Emacs
Keywords=Text;Editor;
# X-KDE-StartupNotify=false
#+end_src

Lastly, while I'm not sure quite why it happens, but after a bit it seems that new emacsclient frames start on the =*scratch*= buffer instead of the dashboard. I prefer the dashboard, so let's ensure that's always switched to in new frames.

#+begin_src emacs-lisp
(when (daemonp)
  (add-hook! 'server-after-make-frame-hook
    (unless (string-match-p "\\*draft\\|\\*stdin\\|emacs-everywhere" (buffer-name))
      (switch-to-buffer +doom-dashboard-name))))
#+end_src

*** Client Wrapper
I frequently want to make use of Emacs while in a terminal emulator. To make this easier, I can construct a few handy aliases.

However, a little convenience script in ~/.local/bin can have the same effect, be available beyond the specific shell I plop the alias in, then also allow me to add a few bells and whistles — namely:
- Accepting stdin by putting it in a temporary file and immediately opening it.
- Guessing that the tty is a good idea when $DISPLAY is unset (relevant with SSH sessions, among other things).
- With a whiff of 24-bit colour support, sets TERM variable to a terminfo that (probably) announces 24-bit colour support.
- Changes GUI emacsclient instances to be non-blocking by default (--no-wait), and instead take a flag to suppress this behaviour (-w).

I would use sh, but using arrays for argument manipulation is just too convenient, so I’ll raise the requirement to bash. Since arrays are the only ’extra’ compared to sh, other shells like ksh etc. should work too.

#+begin_src bash :tangle ~/.local/bin/e :shebang #!/usr/bin/env bash
force_tty=false
force_wait=false
stdin_mode=""

args=()

while :; do
    case "$1" in
    -t | -nw | --tty)
        force_tty=true
        shift
        ;;
    -w | --wait)
        force_wait=true
        shift
        ;;
    -m | --mode)
        stdin_mode=" ($2-mode)"
        shift 2
        ;;
    -h | --help)
        echo -e "\033[1mUsage: e [-t] [-m MODE] [OPTIONS] FILE [-]\033[0m

Emacs client convenience wrapper.

\033[1mOptions:\033[0m
\033[0;34m-h, --help\033[0m            Show this message
\033[0;34m-t, -nw, --tty\033[0m        Force terminal mode
\033[0;34m-w, --wait\033[0m            Don't supply \033[0;34m--no-wait\033[0m to graphical emacsclient
\033[0;34m-\033[0m                     Take \033[0;33mstdin\033[0m (when last argument)
\033[0;34m-m MODE, --mode MODE\033[0m  Mode to open \033[0;33mstdin\033[0m with

Run \033[0;32memacsclient --help\033[0m to see help for the emacsclient."
        exit 0
        ;;
    --*=*)
        set -- "$@" "${1%%=*}" "${1#*=}"
        shift
        ;;
    ,*)
        if [ "$#" = 0 ]; then
            break
        fi
        args+=("$1")
        shift
        ;;
    esac
done

if [ ! "${#args[*]}" = 0 ] && [ "${args[-1]}" = "-" ]; then
    unset 'args[-1]'
    TMP="$(mktemp /tmp/emacsstdin-XXX)"
    cat >"$TMP"
    args+=(--eval "(let ((b (generate-new-buffer \"*stdin*\"))) (switch-to-buffer b) (insert-file-contents \"$TMP\") (delete-file \"$TMP\")${stdin_mode})")
fi

if [ -z "$DISPLAY" ] || $force_tty; then
    # detect terminals with sneaky 24-bit support
    if { [ "$COLORTERM" = truecolor ] || [ "$COLORTERM" = 24bit ]; } &&
        [ "$(tput colors 2>/dev/null)" -lt 257 ]; then
        if echo "$TERM" | grep -q "^\w\+-[0-9]"; then
            termstub="${TERM%%-*}"
        else
            termstub="${TERM#*-}"
        fi
        if infocmp "$termstub-direct" >/dev/null 2>&1; then
            TERM="$termstub-direct"
        else
            TERM="xterm-direct"
        fi # should be fairly safe
    fi
    emacsclient --tty --create-frame --alternate-editor="$ALTERNATE_EDITOR" "${args[@]}"
else
    if ! $force_wait; then
        args+=(--no-wait)
    fi
    emacsclient --create-frame --alternate-editor="$ALTERNATE_EDITOR" "${args[@]}"
fi
#+end_src

** Treemacs
To enable bidirectional synchronisation of LSP workspace folders and treemacs projects.

#+begin_src emacs-lisp
(use-package! treemacs
  :defer t
  :init
  (lsp-treemacs-sync-mode 1)
  :config
  (progn
    (setq treemacs-eldoc-display                   'detailed
          treemacs-find-workspace-method           'find-for-file-or-pick-first
          treemacs-indent-guide-style              'line
          treemacs-missing-project-action          'remove
          treemacs-move-forward-on-expand          t
          treemacs-project-follow-cleanup          t
          treemacs-project-follow-into-home        t
          treemacs-recenter-after-file-follow      'always
          treemacs-recenter-after-project-expand   'always
          treemacs-recenter-after-project-jump     'always
          treemacs-recenter-after-tag-follow       'always
          treemacs-recenter-distance               0.2
          treemacs-show-hidden-files               nil
          treemacs-select-when-already-in-treemacs 'next-or-back
          treemacs-sorting                         'alphabetic-numeric-case-insensitive-asc
          treemacs-tag-follow-delay                1.0
          treemacs-width-increment                 5)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)
    (treemacs-indent-guide-mode t)
    (treemacs-project-follow-mode t)
    (treemacs-tag-follow-mode t)
    (when treemacs-python-executable
      (treemacs-git-commit-diff-mode t))

    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple))))

  ;; :bind
  (map! :nvi "M-0" nil)  ; unbind from go to last workspace
  (map! "M-0" #'treemacs-select-window))
        ;; ("SPC e 1"   . treemacs-delete-other-windows)
        ;; ("SPC e t"   . treemacs)
        ;; ("SPC e d"   . treemacs-select-directory)
        ;; ("SPC e b"   . treemacs-bookmark)
        ;; ("SPC e f"   . treemacs-find-file)
        ;; ("SPC e F"   . treemacs-find-tag)))

(after! imenu
  (setq imenu-auto-rescan t))
#+end_src

** Tramp
Faster than the default scp (for small files)

#+begin_src emacs-lisp
(setq tramp-default-method "ssh")
#+end_src

Improve tramp prompt recognition

#+begin_src emacs-lisp
(after! tramp
  (setenv "SHELL" "/bin/bash")
  (setq tramp-shell-prompt-pattern "\\(?:^\\|\n\\|\x0d\\)[^]#$%>\n]*#?[]#$%>] *\\(\e\\[[0-9;]*[a-zA-Z] *\\)*")) ;; default + 
#+end_src

** Web
Default to opening links in +emacs webkit+ firefox

#+begin_src emacs-lisp
;; (setq browse-url-browser-function 'xwidget-webkit-browse-url)
(setq browse-url-browser-function 'browse-url-firefox)
#+end_src

** Windows
*** TODO Moom
Moom is a package for manipulating the size and location of the actual emacs window. This is particularly useful on my mac.

Firstly, set the default margin

#+begin_src emacs-lisp
;; (setq moom-user-margin '(50 50 50 50)) ; {top, bottom, left, right}
;; (moom-mode 1)
#+end_src
*** Within Emacs
+ Make Doom Emacs ask which buffer to see after splitting a window.
+ Take new window space from all other windows (not just current).
+ Window rotation is nice, and can be found under SPC w r and SPC w R.
  - Layout rotation is also nice though. Let’s stash this under SPC w a.

+ We could also do with adding the missing arrow-key variants of the window navigation/swapping commands.
+ I also like to be able to preview buffers when I switch them.

#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)

(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (counsel-buffer-or-recentf))

(setq window-combination-resize t)

(map! :map evil-window-map
      "SPC" #'rotate-layout
      ;; Navigation
      "<left>"     #'evil-window-left
      "<down>"     #'evil-window-down
      "<up>"       #'evil-window-up
      "<right>"    #'evil-window-right
      ;; Swapping windows
      "C-<left>"       #'+evil/window-move-left
      "C-<down>"       #'+evil/window-move-down
      "C-<up>"         #'+evil/window-move-up
      "C-<right>"      #'+evil/window-move-right)

(map! :leader
      :desc "Switch workspace buffer" "," #'+vertico/switch-workspace-buffer)
#+end_src

** Yasnippets
Enable nested snippets

#+begin_src emacs-lisp
(setq yas-triggers-in-field t)
#+end_src

Smart parentheses and inline LaTeX

#+begin_src emacs-lisp
(sp-local-pair
 '(org-mode)
 "<<" ">>"
 :actions '(insert))

(sp-local-pair
 '(org-mode)
 "$$" "$$"
 :actions '(insert))
#+end_src

* Appearance
