home/.doom.d/config.org
** Fonts
Doom exposes five (optional) variables for controlling fonts in Doom. Here are the three important ones:
+ `doom-font'
+ `doom-variable-pitch-font'
+ `doom-big-font' -- used for `doom-big-font-mode'
  - use this for presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd font string. You generally only need doom-font and doom-variable-pitch-font.

#+begin_src emacs-lisp
(when (string= (system-name) "maccie")
  (setq doom-font (font-spec :family "Fira Code" :size 15)
        doom-big-font (font-spec :family "Iosevka Aile" :size 20)
        doom-variable-pitch-font (font-spec :family "Iosevka Aile" :size 15)))

(when (string= (system-name) "arch")
  (setq doom-font (font-spec :family "Fira Code" :size 16)
        doom-big-font (font-spec :family "Iosevka Aile" :size 21)
        doom-variable-pitch-font (font-spec :family "Iosevka Aile" :size 16)))
#+end_src

Use LaTeX as the default input method to type special characters

#+begin_src emacs-lisp
(after! text-mode
  (set-input-method 'TeX))
#+end_src

Disable prettify symbols globally

#+begin_src emacs-lisp
(setq global-prettify-symbols-mode nil)
#+end_src

** Minimap
Display the minimap (doesn't work well with org files \therefore disabled)

#+begin_src emacs-lisp
;; (setq minimap-mode 0)
#+end_src

** Modeline
Adjust some settings

#+begin_src emacs-lisp
;; (display-time-mode 1) ; Show the time
(size-indication-mode 1) ; Info about what's going on
(setq display-time-default-load-average nil) ; Hide the load average
(setq all-the-icons-scale-factor 1.2) ; prevent the end of the modeline from being cut off
#+end_src

Alter the colour of the filename in the buffer when modifications have been made to a file

#+begin_src emacs-lisp
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "orchid2"))
#+end_src

Conditionally hide the encoding

#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+end_src

Alter the modeline for viewing PDFs

#+begin_src emacs-lisp
(after! doom-modeline
  (doom-modeline-def-segment buffer-name
    "Display the current buffer's name, without any other information."
    (concat
     (doom-modeline-spc)
     (doom-modeline--buffer-name)))

  (doom-modeline-def-segment pdf-icon
    "PDF icon from all-the-icons."
    (concat
     (doom-modeline-spc)
     (doom-modeline-icon 'octicon "file-pdf" nil nil
                         :face (if (doom-modeline--active)
                                   'all-the-icons-red
                                 'mode-line-inactive)
                         :v-adjust 0.02)))

  (defun doom-modeline-update-pdf-pages ()
    "Update PDF pages."
    (setq doom-modeline--pdf-pages
          (let ((current-page-str (number-to-string (eval `(pdf-view-current-page))))
                (total-page-str (number-to-string (pdf-cache-number-of-pages))))
            (concat
             (propertize
              (concat (make-string (- (length total-page-str) (length current-page-str)) ? )
                      " P" current-page-str)
              'face 'mode-line)
             (propertize (concat "/" total-page-str) 'face 'doom-modeline-buffer-minor-mode)))))

  (doom-modeline-def-segment pdf-pages
    "Display PDF pages."
    (if (doom-modeline--active) doom-modeline--pdf-pages
      (propertize doom-modeline--pdf-pages 'face 'mode-line-inactive)))

  (doom-modeline-def-modeline 'pdf
    '(bar window-number pdf-pages pdf-icon buffer-name)
    '(misc-info matches major-mode process vcs)))
#+end_src

