home/.doom.d/config.el

;; (use-package! copilot-chat
;;   :defer t
;;   :config
;;   (setq copilot-chat-model "o1-preview"
;;         copilot-chat-frontend 'org))

(map! :map copilot-chat-map
      :n "M-p" #'copilot-chat-prompt-history-previous
      :n "M-n" #'copilot-chat-prompt-history-next
      :leader
      (:prefix ("cg" . "Copilot Chat")
       :desc "add current buffer" "a" #'copilot-chat-add-current-buffer
       :desc "switch to buffer" "b" #'copilot-chat-switch-to-buffer
       :desc "delete buffer" "D" #'copilot-chat-del-current-buffer
       :desc "buffer list" "l" #'copilot-chat-list
       :desc "display" "g" #'copilot-chat-display
       :desc "reset" "R" #'copilot-chat-reset
       :desc "explain" "e" #'copilot-chat-explain
       :desc "explain symbol at point" "s" #'copilot-chat-explain-symbol-at-line
       :desc "explain function at point" "f" #'copilot-chat-explain-defun
       :desc "review" "r" #'copilot-chat-review
       :desc "review entire buffer" "B" #' copilot-chat-review-whole-buffer
       :desc "document" "d" #'copilot-chat-doc
       :desc "fix" "f" #'copilot-chat-fix
       :desc "optimise" "o" #'copilot-chat-optimize
       :desc "test" "t" #'copilot-chat-test
       :desc "custom paste" "P" #'copilot-chat-custom-prompt-selection
       :desc "custom function prompt" "F" #'copilot-chat-custom-prompt-function
       :desc "ask and insert" "i" #'copilot-chat-ask-and-insert
       :desc "insert commit message" "c" #'copilot-chat-insert-commit-messages
       :desc "set model" "m" #'copilot-chat-set-model))

(use-package! indent-bars
  :hook ((prog-mode python-mode sh-mode f90-mode julia-mode yaml-mode) . indent-bars-mode)
  :custom
  (indent-bars-treesit-support t)
  (indent-bars-color '(highlight :face-bg t :blend 0.2))
  (indent-bars-pattern ".")
  (indent-bars-pad-frac 0.1)
  (indent-bars-highlight-current-depth '(:blend 0.55)))

(map! :leader
      :desc "Indent bars" "t i" #'indent-bars-mode)

(add-hook! 'prog-mode-hook #'rainbow-delimiters-mode)
(add-hook! 'sh-mode-hook #'rainbow-delimiters-mode)

(+global-word-wrap-mode +1)
;; (add-hook! 'prog-mode-hook #'+word-wrap-mode)
;; (add-hook! 'sh-mode-hook #'+word-wrap-mode)

(map! :leader
      :desc "Magit pull" "g p" #'magit-pull
      :desc "Magit push" "g P" #'magit-push
      :desc "Magit diff" "g d" #'magit-diff
      :desc "Magit stash" "g z" #'magit-stash
      :desc "Magit stage all" "g a" #'magit-stage-modified
      :desc "Magit unstage all" "g A" #'magit-unstage-all)

(after! sh-mode
  (sh-set-shell "bash"))
  ;; (when (equal (string-match-p (regexp-quote "*PKGBUILD")
  ;;                              (buffer-file-name))
  ;;              "PKGBUILD")
  ;;   (sh-set-shell "bash")))

(after! sh-mode
  (setq sh-indentation
        sh-basic-offset 2))

(after! f90
  (setq f90-do-indent 2)
  (setq f90-if-indent 2)
  (setq f90-type-indent 2)
  (setq f90-program-indent 2)
  (setq f90-continuation-indent 4)
  (setq f90-smart-end 'blink)

  ;; TODO: copy rc params file from apollo to mac
  (set-formatter! 'fprettify '("fprettify" "-i 2" "-l 88" "-w 4" "--whitespace-comma=true" "--whitespace-assignment=true" "--whitespace-decl=true" "--whitespace-relational=true" "--whitespace-plusminus=true" "--whitespace-multdiv=true" "--whitespace-print=true" "--whitespace-type=true" "--whitespace-intrinsics=true" "--strict-indent" "--enable-decl" "--enable-replacements" "--c-relations" "--case 1 1 1 1" "--strip-comments" "--disable-fypp") :modes '(f90-mode fortran-mode)))

(after! fortran
  (setq fortran-continuation-string "&")
  (setq fortran-do-indent 2)
  (setq fortran-if-indent 2)
  (setq fortran-structure-indent 2)

  (set-formatter! 'fprettify '("fprettify" "-i 2" "-l 88" "-w 4" "--whitespace-comma=true" "--whitespace-assignment=true" "--whitespace-decl=true" "--whitespace-relational=true" "--whitespace-plusminus=true" "--whitespace-multdiv=true" "--whitespace-print=true" "--whitespace-type=true" "--whitespace-intrinsics=true" "--strict-indent" "--enable-decl" "--enable-replacements" "--c-relations" "--case 1 1 1 1" "--strip-comments" "--disable-fypp") :modes '(f90-mode fortran-mode)))

(setq auto-mode-alist
      (cons '("\\.F90$" . f90-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.f90$" . f90-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.pf$" . f90-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.pf$" . f90-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.fpp$" . f90-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.F$" . fortran-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.f$" . fortran-mode) auto-mode-alist))

(use-package! lsp-mode
  :hook (f90-mode . lsp-deferred))

(use-package! julia-mode
  :defer t
  :init
  (setenv "JULIA_NUM_THREADS" "6")
  :interpreter
  ("julia" . julia-mode))

(after! julia
  (add-hook! 'before-save-hook #'julia-snail/formatter-format-buffer))

(setq lsp-julia-package-dir nil)

(after! lsp-julia
  (setq lsp-julia-default-environment "~/.julia/environments/v1.11"))

(add-hook! 'julia-mode-hook #'lsp-mode)

(setq julia-snail-extensions '(repl-history formatter ob-julia))

(map! :after julia-mode
      :map julia-mode-map
      :localleader
      ;; Rebind julia-snail to "m" to make it easier to jump between the REPL and .jl file
      :desc "" "'" nil
      :desc "Julia Snail" "m" #'julia-snail
      :desc "Format buffer" "f" #'julia-snail/formatter-format-buffer
      :desc "Format region" "F" #'julia-snail/formatter-format-region
      :desc "Paste REPL history" "p" #'julia-snail/repl-history-yank
      :desc "Show REPL history" "b" #'julia-snail/repl-history-buffer
      :desc "Search and paste REPL history" "s" #'julia-snail/repl-history-search-and-yank)

(setq! bibtex-completion-bibliography '("~/Documents/warwick/thesus/references.bib"))
