home/.doom.d/config.org
** Babel
+ Use python code blocks in org mode (as well as some other languages thrown in)
+ Don't require :results output as a header in python SRC blocks
+ Formatting for source code blocks

#+begin_src emacs-lisp
(after! org
  (require 'ob-fortran)
  (require 'ob-julia)
  (require 'ob-latex)
  (require 'ob-lua)
  (require 'ob-python)
  (require 'ob-shell)

  (require 'org-src)
  (require 'ob-emacs-lisp)
  (require 'ob-async)
  ;; (require 'ob-jupyter)
  ;; (require 'jupyter)
  ;; (require 'jupyter-org-client)

  (setq org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-src-window-setup 'other-window)

  (set-popup-rule! "^\\*Org Src" :ignore t))
#+end_src

Specify shortcuts for src blocks with specific languages

#+begin_src emacs-lisp
(after! org
  (setq org-structure-template-alist
        '(("a" . "export ascii\n")
          ("b" . "src bash\n")
          ("c" . "center\n")
          ("C" . "comment\n")
          ("e" . "example\n")
          ("E" . "export\n")
          ("f" . "src f90\n")
          ("h" . "export html\n")
          ("j" . "src jupyter-python\n")
          ("J" . "src julia\n")
          ("l" . "src emacs-lisp\n")
          ("L" . "export latex\n")
          ("p" . "src python\n")
          ("q" . "quote\n")
          ("s" . "src")
          ("S" . "src shell\n")
          ("t" . "src latex\n")
          ("v" . "verse\n"))))

(map! :map org-mode-map
      :after org
      :localleader
      :desc "org-insert-template" "w" #'org-insert-structure-template)
#+end_src

Define keybindings for some commands I commonly use

#+begin_src emacs-lisp
(map! :map org-mode-map
      :after org
      :localleader
      "k" nil
      "K" nil
      :prefix ("B" . "babel")
      :desc "Insert header arg" "a" #'org-babel-insert-header-arg
      :desc "Execute buffer" "b" #'org-babel-execute-buffer
      :desc "Check SRC block" "c" #'org-babel-check-src-block
      :desc "Demarcate block" "d" #'org-babel-demarcate-block
      :desc "Go to src block" "g" #'org-babel-goto-named-src-block
      :desc "Go to result" "G" #'org-babel-goto-named-result
      :desc "Toggle result visibility" "h" #'org-babel-hide-result-toggle
      :desc "Hide all results" "H" #'org-babel-result-hide-all
      :desc "Jupyter buffer" "j" #'org-babel-jupyter-scratch-buffer
      :desc "Open result" "o" #'org-babel-open-src-block-result
      :desc "Remove result" "r" #'org-babel-remove-result
      :desc "Remove all results" "R" #'+org/remove-result-blocks
      :desc "Execute subtree" "s" #'org-babel-execute-subtree
      :desc "Tangle SRC blocks" "t" #'org-babel-tangle)
#+end_src

** Buffers
Make creating org buffers a little easier

#+begin_src emacs-lisp
(evil-define-command +evil-buffer-org-new (_count file)
  "Creates a new ORG buffer replacing the current window, optionally editing a certain FILE"
  :repeat nil
  (interactive "P<f>")
  (if file
      (evil-edit file)
    (let ((buffer (generate-new-buffer "*new org*")))
      (set-window-buffer nil buffer)
      (with-current-buffer buffer
        (org-mode)
        (setq-local doom-real-buffer-p t)))))

(map! :leader
      :prefix "b"
      :desc "New empty Org buffer" "o" #'+evil-buffer-org-new)
#+end_src

** Capture
Quickly take down notes

#+begin_src emacs-lisp
(after! org
  (setq org-capture-templates
      '(("t" "Tasks" entry
         (file+headline "" "Inbox")
         "* TODO %?\n %U")
        ("c" "Phone Call" entry
         (file+headline "" "Inbox")
         "* TODO Call %?\n %U")
        ("m" "Meeting" entry
         (file+headline "" "Meetings")
         "* %?\n %U"))))
#+end_src
** TODO Cite
Include citations in org-mode

References in Org are fairly easy now, thanks to ~org-cite~. The ~:tools biblio~ module gives a fairly decent basic setup, but it would be nice to take it a bit further. This mostly consists of tweaking settings, but there is one extra package I’ll grab for prettier in-buffer citations.

In particular, by setting ~org-cite-csl-activate-use-document-style~, we can have the in-buffer displayed citations be the same as the exported form. Isn’t that lovely!

Unfortunately, there’s currently a potential for undesirable buffer modifications, so we’ll put all the activation code behind a function we can call when we want it.

#+begin_src emacs-lisp
(use-package! oc-csl-activate
  :after (oc citar)
  :hook (org-mode . (lambda ()
                      (cursor-sensor-mode 1)
                      (org-cite-csl-activate-render-all)))
  :config
  (setq org-cite-activate-processor 'csl-activate
        org-cite-csl-activate-use-document-style t
        org-cite-csl-activate-use-document-style t
        org-cite-csl-activate-use-document-locale t
        org-cite-csl-activate-use-citar-cache t))

;; (defun +org-cite-csl-activate/enable ()
;;   (interactive)
;;   (setq org-cite-activate-processor 'csl-activate)
;;   (add-hook! 'org-mode-hook '((lambda () (cursor-sensor-mode 1)) org-cite-csl-activate-render-all))
;;   (defadvice! +org-cite-csl-activate-render-all-silent (orig-fn)
;;     :around #'org-cite-csl-activate-render-all
;;     (with-silent-modifications (funcall orig-fn)))
;;   (when (eq major-mode 'org-mode)
;;     (with-silent-modifications
;;       (save-excursion
;;         (goto-char (point-min))
;;         (org-cite-activate (point-max)))
;;       (org-cite-csl-activate-render-all)))
;;   (fmakunbound #'+org-cite-csl-activate/enable)))
#+end_src

Now that ~oc-csl-activate~ is set up, let’s go ahead and customise some of the packages already loaded. For starters, we can make use of the my Zotero files with citar, and make the symbols a bit prettier.

#+begin_src emacs-lisp
(after! citar
  (setq org-cite-global-bibliography
        (let ((libfile-search-names '("references.bib" "references.json"))
              (libfile-dir "~/Documents/org/")
              paths)
          (dolist (libfile libfile-search-names)
            (when (and (not paths)
                       (file-exists-p (expand-file-name libfile libfile-dir)))
              (setq paths (list (expand-file-name libfile libfile-dir)))))
          paths)
        citar-bibliography org-cite-global-bibliography
        citar-symbols
        `((file ,(nerd-icons-faicon "nf-fa-file_o" :face 'nerd-icons-green :v-adjust -0.1) . " ")
          (note ,(nerd-icons-octicon "nf-oct-note" :face 'nerd-icons-blue :v-adjust -0.3) . " ")
          (link ,(nerd-icons-octicon "nf-oct-link" :face 'nerd-icons-orange :v-adjust 0.01) . " "))))
#+end_src

We can also make the Zotero CSL styles available to use.

#+begin_src emacs-lisp
(after! oc-csl
  (setq org-cite-csl-styles-dir "~/Zotero/styles"))
#+end_src

Since CSL works so nicely everywhere, we might as well use it as the default citation export processor for everything.

#+begin_src emacs-lisp
(after! oc
  (setq org-cite-export-processors '((t csl))))
#+end_src

** Company
Company completion of org blocks

#+begin_src emacs-lisp
(use-package! company-org-block
  :custom
  (company-org-block-edit-style 'auto) ;; 'auto, 'prompt, or 'inline
  :hook ((org-mode . (lambda ()
                       (setq-local company-backends '(company-org-block))
                       (company-mode +1)))))
#+end_src

** TODO Exporting
*** Commands
I like to export markdown files written in org as README.org. I'm creating a shortcut to use for this in future.

I also export a lot of org files to markdown and LaTeX so I will also add another shortcut for these commands here.

#+begin_src emacs-lisp
(map! :map org-mode-map
      :after org
      :localleader
      :desc "org-export-to-org"
      "E" 'org-org-export-to-org
      :desc "org-export-to-LaTeX-pdf"
      "L" 'org-latex-export-to-pdf
      :desc "org-export-as-md"
      "M" 'org-pandoc-export-to-markdown)
#+end_src

** File Conversions
Leaving org is sad. Thankfully, there's a way around this!
+ Package installed in packages.el

#+begin_src emacs-lisp
(use-package! org-pandoc-import
  :after org)
#+end_src

