home/.doom.d/config.org
** File Headers
Provide different options for default headers for emacs org files

#+begin_src emacs-lisp
(defun org-literate-config ()
  (interactive)
  (setq title (read-string "Title: "))
  (setq filename (read-string "Original file name: "))
  (insert "#+TITLE: " title " \n"
          "#+AUTHOR: Dylan Morgan\n"
          "#+EMAIL: dbmorgan98@gmail.com\n"
          "#+PROPERTY: header-args :tangle " filename "\n"
          "#+STARTUP: content\n\n"
          "* Table of Contents :toc:\n\n"))

(defun org-header-notes ()
  (interactive)
  (setq title (read-string "Title: "))
  (insert "#+TITLE: " title " \n"
          "#+AUTHOR: Dylan Morgan\n"
          "#+EMAIL: dbmorgan98@gmail.com\n"
          "#+STARTUP: content\n\n"
          "* Table of Contents :toc:\n\n"))

(defun org-header-notes-custom-property ()
  (interactive)
  (setq title (read-string "Title: "))
  (setq properties (read-string "Properties: "))
  (insert "#+TITLE: " title " \n"
          "#+AUTHOR: Dylan Morgan\n"
          "#+EMAIL: dbmorgan98@gmail.com\n"
          "#+PROPERTY: " properties "\n"
          "#+STARTUP: content\n\n"
          "* Table of Contents :toc:\n\n"))

(defun org-header-with-readme ()
  (interactive)
  (setq title (read-string "Title: "))
  (insert "#+TITLE: " title " \n"
          "#+AUTHOR: Dylan Morgan\n"
          "#+EMAIL: dbmorgan98@gmail.com\n"
          "#+STARTUP: content\n"
          "#+EXPORT_FILE_NAME: ./README.org\n\n"
          "* Table of Contents :toc:\n\n"))

(map! :map org-mode-map
      :after org
      :localleader
      :prefix ("k" . "org header")
      :desc "literate config"
      "l" 'org-literate-config
      :desc "note taking"
      "n" 'org-header-notes
      :desc "notes custom property"
      "p" 'org-header-notes-custom-property
      :desc "header with readme"
      "r" 'org-header-with-readme)
#+end_src

** General
+ Default file location
  - If you use `org' and don't want your org files in the default location below,
    change `org-directory'. It must be set before org loads!

+ It's convenient to have properties inherited
+ Alphabetical lists
+ Export processes in external emacs process
+ Try to not accidentally do weird stuff in invisible regions

#+begin_src emacs-lisp
(setq org-directory "~/Documents/org/"
      org-id-locations-file "~/.config/emacs/.local/cache/.org-id-locations"
      org-use-property-inheritance t
      org-list-allow-alphabetical t
      org-export-in-background t
      org-fold-catch-invisible-edits 'smart)
#+end_src

*** Special Block Extras
#+begin_src emacs-lisp
(use-package! org-special-block-extras
  :hook (org-mode . org-special-block-extras-mode))
#+end_src

** TODO Headings
Show all headings on opening an org file and do not number by default

#+begin_src emacs-lisp
(after! org
  (setq org-startup-folded 'content
        org-startup-numerated nil))
#+end_src

Set plain list indents such that the bullet point style signifies the indentation level

#+begin_src emacs-lisp
(after! org
  (setq org-list-demote-modify-bullet '(("-" . "+")
                                        ("+" . "-")
                                        ("1." . "a.")
                                        ("1)" . "a)")))

  (setq org-list-use-circular-motion t
        org-list-allow-alphabetical t))
#+end_src

Change the heading weights

#+begin_src emacs-lisp
(after! org
  ;; (dolist (face '((org-level-1 . 1.2)
  ;;                 (org-level-2 . 1.1)
  ;;                 (org-level-3 . 1.05)
  ;;                 (org-level-4 . 1.0)
  ;;                 (org-level-5 . 1.1)
  ;;                 (org-level-6 . 1.1)
  ;;                 (org-level-7 . 1.1)
  ;;                 (org-level-8 . 1.1)))
  ;;   (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'bold :height (cdr face)))

  ;; ;; Make the document title a bit bigger
  ;; (set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.8)

  ;; (require 'org-indent)
  ;; (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))

  ;; (set-face-attribute 'org-block nil            :foreground nil :inherit
  ;;                     'fixed-pitch :height 0.85)
  ;; (set-face-attribute 'org-code nil             :inherit '(shadow fixed-pitch) :height 0.85)
  ;; (set-face-attribute 'org-indent nil           :inherit '(org-hide fixed-pitch) :height 0.85)
  ;; (set-face-attribute 'org-verbatim nil         :inherit '(shadow fixed-pitch) :height 0.85)
  ;; (set-face-attribute 'org-special-keyword nil  :inherit '(font-lock-comment-face fixed-pitch))
  ;; (set-face-attribute 'org-meta-line nil        :inherit '(font-lock-comment-face fixed-pitch))
  ;; (set-face-attribute 'org-checkbox nil         :inherit 'fixed-pitch)

  ;; (add-hook! 'org-mode-hook #'variable-pitch-mode)

  (setq org-ellipsis " ... "))
        ;; org-edit-src-content-indentation 0
        ;; org-tags-column -80))
#+end_src

** Images
Automatically display images when opening an org file. Also add support for eps images

#+begin_src emacs-lisp
(after! org
  (setq org-startup-with-inline-images t
        ;; org-image-actual-width 400
        imagemagick-enabled-types t)
  (imagemagick-register-types)
  (add-to-list 'image-file-name-extensions "eps"))
#+end_src

Add a background to images with a transparent background so they are legible with a dark theme

#+begin_src emacs-lisp
(after! org
  (defun org--create-inline-image-advice (img)
    (nconc img (list :background "#fafafa")))
  (advice-add 'org--create-inline-image
              :filter-return #'org--create-inline-image-advice))
#+end_src

** Jupyter
Enable Jupyter support in org-mode using the Jupyter package

#+begin_src emacs-lisp
(after! org
  (setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                       (:session . "py")))
  (org-babel-do-load-languages 'org-babel-load-languages '((emacs-lisp)
                                                           (bash . t)
                                                           (julia . t)
                                                           (python . t))))

(map! :map org-mode-map
      :after org
      :localleader
      :prefix ("j"" . "jupyter)
      :desc "Execute and next block" "b" #'jupyter-org-execute-and-next-block
      :desc "Clone block" "c" #'jupyter-org-clone-block
      :desc "Copy block and results" "C" #'jupyter-org-copy-block-and-results
      :desc "Go to error" "e" #'jupyter-org-goto-error
      :desc "Edit header" "h" #'jupyter-org-edit-header
      :desc "Interrupt kernel" "i" #'jupyter-org-interrupt-kernel
      :desc "Jump to block" "j" #'jupyter-org-jump-to-block
      :desc "Move block" "m" #'jupyter-org-move-src-block
      :desc "Merge blocks" "M" #'jupyter-org-merge-blocks
      :desc "Next busy block" "n" #'jupyter-org-next-busy-src-block
      :desc "Previous busy block" "N" #'jupyter-org-previous-busy-src-block
      :desc "Execute to point" "p" #'jupyter-org-execute-to-point
      :desc "Restart to point" "r" #'jupyter-org-restart-kernel-and-execute-to-point
      :desc "Restart execute buffer" "R" #'jupyter-org-restart-kernel-execute-buffer
      :desc "Split block" "s" #'jupyter-org-split-src-block)
#+end_src

Disable the ~org-element-at-point~ warning caused by ~jupyter-org-interaction-mode~

#+begin_src emacs-lisp
(add-to-list 'warning-suppress-types '(org-element org-element-parser))
#+end_src

** TODO Journal

#+begin_src emacs-lisp
(use-package! org-journal
  :defer t
  :config
  (setq org-journal-carryover-delete-empty-journal "ask"
        org-journal-enable-agenda-integration t
        org-journal-file-format "%Y%m"
        org-journal-file-type 'monthly
        org-journal-follow-mode t))
  ;; (setq org-capture-templates '(("j" "Journal entry" plain))))
#+end_src

** Keybindings
Change some of the org keybindings

#+begin_src emacs-lisp
;; (defun org-insert-newline-heading ()
;;   ('newline)
;;   ('org-insert-heading))

;; (map! :map org-mode-map
;;       :after org
;;       :desc "Insert Heading"
;;       "M-<return>" 'org-insert-newline-heading)

(map! :map org-mode-map
      :after org
      :desc "Insert Heading"
      "M-<return>" 'org-insert-heading)
#+end_src

** LaTeX
*** CDLaTeX
Enable cdlatex by default and edit an environment after inserting one.

#+begin_src emacs-lisp
(after! org
  (setq org-startup-with-latex-preview t)
  (add-hook! 'org-mode-hook #'turn-on-org-cdlatex)

  (defadvice! org-edit-latex-emv-after-insert ()
    :after #' org-cdlatex-environment-indent
    (org-edit-latex-environment)))
#+end_src

