home/.doom.d/config.org
*** TODO In-line Fragments
- Use org-fragtog mode to automatically generate latex fragments
- Change latex to lualatex for preview so it works with some packages need to output org to pdf
- Change Latex fragment size

#+begin_src emacs-lisp
(add-hook! 'org-mode-hook #'org-fragtog-mode)

(after! org
  (setq org-preview-latex-default-process 'dvisvgm)

  ;; Set the image size depending on which computer I'm on
  (let ((image-size-adjust
         (if (string= (system-name) "maccie")
             '(2.0 . 2.0)
           '(1.6 . 1.6)))) ; fallback value

    (setf (alist-get 'dvipng org-preview-latex-process-alist)
          `(:programs ("lualatex" "dvipng")
            :description "dvi > png"
            :message "You need to install the programs: lualatex and dvipng."
            :image-input-type "dvi"
            :image-output-type "png"
            :image-size-adjust (1.0 . 1.0)
            :latex-compiler ("lualatex --interaction nonstopmode --output-format=dvi --output-directory %o %f")
            :image-converter ("dvipng -D %D -T tight -o %O %f")
            :transparent-image-converter ("dvipng -D %D -T tight -bg Transparent -o %O %f"))

          (alist-get 'dvisvgm org-preview-latex-process-alist)
          `(:programs ("lualatex" "dvisvgm")
            :description "dvi > svg"
            :message "you need to install the programs: lualatex and dvisvgm."
            :image-input-type "dvi"
            :image-output-type "svg"
            :image-size-adjust ,image-size-adjust
            :latex-compiler ("lualatex --interaction nonstopmode --output-format=dvi --output-directory %o %f")
            :image-converter ("dvisvgm %f --no-fonts --exact-bbox --scale=%S --output=%O"))

          (alist-get 'imagemagick org-preview-latex-process-alist)
          `(:programs ("lualatex" "convert")
            :description "pdf > png"
            :message "you need to install the programs: latex and imagemagick."
            :image-input-type "pdf"
            :image-output-type "png"
            :image-size-adjust (1.0 . 1.0)
            :latex-compiler ("lualatex --interaction nonstopmode --output-directory %o %f")
            :image-converter ("magick convert -density %D -trim -antialias %f -quality 100 %O")))

    (plist-put org-format-latex-options :scale 1.5)
    (plist-put org-format-latex-options :html-scale 1.0)
    ;; (plist-put org-format-latex-options :foreground "white")
    (plist-put org-format-latex-options :background "Transparent")
    (plist-put org-format-latex-options :matchers '("begin" "$1" "$" "$$" "\\(" "\\["))))

;; '(org-format-latex-options
;;   (quote
;;    (:foreground default :background default :scale 2 :html-foreground "Black" :html-background "Transparent" :html-scale 1 :matchers
;;     ("begin" "$1" "$" "$$" "\\(" "\\[")))))

;; (defun update-org-latex-fragments ()
;;   (org-latex-preview '(64))
;;   (plist-put org-format-latex-options :scale text-scale-mode-amount)
;;   (org-latex-preview '(16)))

;; (add-hook! 'text-scale-mode-hook #'update-org-latex-fragments)
#+end_src

*** Org Code Blocks
Use engraved instead of verbatim src blocks. I used to use listings but have since upgraded to engraved

+ One annoyance with this is the interaction between =microtype= and =verbatim= environments. Protrusion is not desirable here. Thankfully, we can patch the =verbatim= environment to turn off protrusion locally.
+ Also have the example block be styled similarly

#+begin_src emacs-lisp
(use-package! engrave-faces-latex
  :after ox-latex
  :config
  (setq org-latex-listings 'engraved
        org-latex-engraved-theme 'doom-one))

;; (org-export-update-features 'latex
;;                             (no-protrusion-in-code
;;                              :condition t
;;                              :when (microtype engraved-code)
;;                              :snippet "\\ifcsname Code\\endcsname\n  \\let\\oldcode\\Code\\renewcommand{\\Code}{\\microtypesetup{protrusion=false}\\oldcode}\n\\fi"
;;                              :after (engraved-code microtype)))

;; (defadvice! org-latex-example-block-engraved (orig-fn example-block contents info)
;;   "Like `org-latex-example-block', but supporting an engraved backend"
;;   :around #'org-latex-example-block
;;   (let ((output-block (funcall orig-fn example-block contents info)))
;;     (if (eq 'engraved (plist-get info :latex-listings))
;;         (format "\\begin{Code}[alt]\n%s\n\\end{Code}" output-block)
;;       output-block)))

(after! org
    (setq org-latex-src-block-backend 'engraved))
    ;; (setq org-latex-engraved-options))
    ;; (setq org-latex-engraved-preamble))

 ;; (setq org-latex-src-block-backend 'listings)
 ;; (require 'ox-latex)
 ;; (add-to-list 'org-latex-packages-alist '("" "listings"))
 ;; (add-to-list 'org-latex-packages-alist '("" "color")))
#+end_src

*** Prettier Highlighting
We want fragments to look lovely

#+begin_src emacs-lisp
(after! org
  (setq org-highlight-latex-and-related '(native script entities))
  (add-to-list 'org-src-block-faces '("latex" (:inherit default :extend t))))
#+end_src

*** Prettier Rendering
Make LaTeX fragments look better in text

#+begin_src emacs-lisp
;; (setq org-format-latex-header "\\documentclass{article}
;; \\usepackage[usenames]{xcolor}

;; \\usepackage[T1]{fontenc}

;; \\usepackage{booktabs}

;; \\pagestyle{empty}             % do not remove
;; % The settings below are copied from fullpage.sty
;; \\setlength{\\textwidth}{\\paperwidth}
;; \\addtolength{\\textwidth}{-3cm}
;; \\setlength{\\oddsidemargin}{1.5cm}
;; \\addtolength{\\oddsidemargin}{-2.54cm}
;; \\setlength{\\evensidemargin}{\\oddsidemargin}
;; \\setlength{\\textheight}{\\paperheight}
;; \\addtolength{\\textheight}{-\\headheight}
;; \\addtolength{\\textheight}{-\\headsep}
;; \\addtolength{\\textheight}{-\\footskip}
;; \\addtolength{\\textheight}{-3cm}
;; \\setlength{\\topmargin}{1.5cm}
;; \\addtolength{\\topmargin}{-2.54cm}
;; % my custom stuff
;; \\usepackage{arev}
;; ")
#+end_src

Make background colour transparent

#+begin_src emacs-lisp
;; (setq org-format-latex-options
;;       (plist-put org-format-latex-options :background "Transparent"))
#+end_src

