home/.doom.d/config.org
*** TODO Org Present
For more advanced functionality, we can also make presentations using org-present

#+begin_src emacs-lisp
(defun my/org-present-prepare-slide (buffer-name heading)
  (org-overview)  ; Show only top-level headlines
  (org-show-entry)  ; Unfold the current entry
  (org-show-children))  ; Show only direct subheadings of the slide but don't expand them

(defun my/org-present-start ()
  ;; Tweak font sizes
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                     (header-line (:height 4.0) variable-pitch)
                                     (org-document-title (:height 1.75) org-document-title)
                                     (org-code (:height 1.55) org-code)
                                     (org-verbatim (:height 1.55) org-verbatim)
                                     (org-block (:height 1.25) org-block)
                                     (org-block-begin-line (:height 0.7) org-block)))

  ;; Set a blank header line string to create blank space at the top
  (setq header-line-format " ")

  ;; Display inline images automatically
  (org-display-inline-images)

  ;; Center the presentation and wrap lines
  (visual-fill-column-mode 1)
  (visual-line-mode 1))

(defun my/org-present-end ()
  ;; Reset font customizations
  (setq-local face-remapping-alist '((default variable-pitch default)))

  ;; Clear the header line string so that it isn't displayed
  (setq header-line-format nil)

  ;; Stop displaying inline images
  (org-remove-inline-images)

  ;; Stop centering the document
  (visual-fill-column-mode 0)
  (visual-line-mode 0))

(use-package! org-present
  :hook
  ;; (org-mode-hook . variable-pitch-mode)
  (org-present-mode-hook . my/org-present-start)
  (org-present-mode-quit-hook . my/org-present-end)
  (org-present-after-navigate-functions . my/org-present-prepare-slide)
  :config
  ;; Set reusable font name variables
  (defvar my/fixed-width-font "FiraCode Nerd Font"
    "The font to use for monospaced (fixed width) text.")
  (defvar my/variable-width-font "Iosevka Aile"
    "The font to use for variable-pitch (document) text.")

  (set-face-attribute 'default nil :font my/fixed-width-font :weight 'light :height 180)
  (set-face-attribute 'fixed-pitch nil :font my/fixed-width-font :weight 'light :height 190)
  (set-face-attribute 'variable-pitch nil :font my/variable-width-font :weight 'light :height 1.3)

  ;; Load org-faces to make sure we can set appropriate faces
  (require 'org-faces)

  ;; Resize Org headings
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font my/variable-width-font :weight 'medium :height (cdr face)))

  ;; Make the document title a bit bigger
  (set-face-attribute 'org-document-title nil :font my/variable-width-font :weight 'bold :height 1.3)

  ;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  ;; Configure fill width
  (setq visual-fill-column-width 110
        visual-fill-column-center-text t))
#+end_src

*** Reveal.js

#+begin_src emacs-lisp
(setq org-re-reveal-theme "solarized"
      org-re-reveal-revealjs-version "5.1"
      org-re-reveal-slide-number "c/t"
      org-re-reveal-mousewheel "t")
#+end_src

*** Tree Slides
It is possible to give presentations in org-mode using org-tree-slide

#+begin_src emacs-lisp
(use-package! org-tree-slide
  :after org-mode
  :config
  (setq org-image-actual-width nil))
#+end_src

** Prettification
*** Emphasis Markers
We don't want to see underscores and asterisks when writing italic and bold
text.

#+begin_src emacs-lisp
(after! org
  (setq org-hide-emphasis-markers t))
#+end_src

*** Modern
I prefer the older style heading stars when Doom switched to =org-modern=

#+begin_src emacs-lisp
(after! org
  (setq org-modern-list '((45 . "–") (43 . "➤") (42 . "•"))
        ;; org-modern-block-name '("▶ " . "▶ ")
        ;; org-modern-block-name '(" " . " ")
        org-modern-checkbox nil ;'((88 . "[x]") (45 . "[-]") . (32 . "[ ]"))
        org-modern-fold-stars '(("◉" . "◉") ("○" . "○") ("✸" . "✸") ("✿" . "✿") ("▶" . "▼") ("▷" . "▽") ("⯈" . "⯆") ("▹" . "▿") ("▸" . "▾"))
        org-modern-hide-stars nil
        org-modern-table nil
        ;; org-modern-priority (quote ((?A . "❗") (?B . "⬆") (?C . "⬇")))
        org-modern-keyword "▶ "))
#+end_src

**** Indent
Format indented blocks properly

#+begin_src emacs-lisp
(after! org
  (setq org-adapt-indentation t))

(use-package! org-modern-indent
  :after org
  :hook (org-mode . org-modern-indent-mode))
#+end_src

*** Pretty Mode
Make all the things look pretty

#+begin_src emacs-lisp
(after! org
  (setq org-pretty-entities t))
#+end_src

** Roam

#+begin_src emacs-lisp
(use-package! org-roam
  :defer t
  :custom
  (org-roam-directory "~/Documents/org/roam/")
  (org-roam-completion-everywhere t)
  (org-roam-db-location "~/Documents/org/roam/org-roam.db")
  (org-roam-db-autosync-mode t)
  (org-roam-completion-everywhere t))
#+end_src

*** TODO Roam UI

#+begin_src emacs-lisp
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  ;; normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;; a hookable mode anymore, you're advised to pick something yourself
  ;; if you don't care about startup time, use
  ;; :hook (after-init . org-roam-ui-mode)
  ;; :init (setq org-roam-ui-browser-function #'xwidget-webkit-browse-url)
  ;; :hook (org-roam-mode . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src

